{
  "date": "2026-02-21",
  "lastUpdated": "2026-02-21T10:18:10.622Z",
  "articles": [
    {
      "id": "2026-02-20-kurian-joseph-report-reversing-centralisation-strengthening",
      "title": "Kurian Joseph Report: Reversing Centralisation & Strengthening Federalism",
      "summary": "The Kurian Joseph report advocates for reversing the trend of centralisation in India, urging a re-evaluation of Centre-State relations. The report likely highlights issues concerning fiscal federalism, legislative autonomy, and administrative powers, proposing measures to empower states. For UPSC, this is crucial for understanding the dynamics of Indian federalism, the challenges to state autonomy, and the ongoing debate on the distribution of powers. Key concepts include cooperative federalism, fiscal devolution, and constitutional provisions related to Centre-State relations. This report could provoke significant policy debates on governance structure.",
      "category": "polity",
      "date": "2026-02-20",
      "source": "The Hindu",
      "sourceUrl": "https://www.thehindu.com/opinion/editorial/treatise-for-federalism-on-the-tamil-nadu-and-the-kurian-joseph-report/article70656419.ece",
      "importance": "high",
      "tags": [
        "Federalism",
        "Centre-State Relations",
        "State Autonomy",
        "Constitutional Law",
        "Fiscal Federalism"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-II: Polity"
      ],
      "section": "Editorial",
      "processedAt": "2026-02-21T10:17:21.454Z"
    },
    {
      "id": "2026-02-21-chhattisgarh-hc-verdict-on-rape-implications-for-women-s-rig",
      "title": "Chhattisgarh HC Verdict on Rape: Implications for Women's Rights & Justice",
      "summary": "A recent Chhattisgarh High Court verdict in a rape case has drawn criticism for potentially setting back the clock on women's rights and gender justice. The judgment's specific reasoning or interpretation of law is likely seen as regressive, impacting victims' rights and the broader legal framework against sexual violence. For UPSC, this highlights the critical role of the judiciary in upholding constitutional values, gender sensitivity in legal pronouncements, and the ongoing challenges in ensuring justice for vulnerable sections. Aspirants should understand legal precedents, women's protection laws, and the concept of judicial activism versus restraint.",
      "category": "social",
      "date": "2026-02-21",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/opinion/editorials/chhattisgarh-hc-verdict-in-rape-case-turns-back-the-clock-10543346/",
      "importance": "high",
      "tags": [
        "Women's Rights",
        "Gender Justice",
        "Judiciary",
        "Criminal Law",
        "Social Justice"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-I: Social Issues",
        "GS-II: Polity",
        "GS-II: Social Justice"
      ],
      "section": "Editorial",
      "processedAt": "2026-02-21T10:17:21.454Z"
    },
    {
      "id": "2026-02-21-us-section-122-tariffs-implications-for-global-trade-economy",
      "title": "US Section 122 Tariffs: Implications for Global Trade & Economy",
      "summary": "The article explains Section 122 tariffs, a potential US trade policy instrument, and how they might differ from previous tariff regimes, such as those imposed by Trump. Section 122 of the Trade Act of 1974 allows the President to impose tariffs or other import restrictions under certain conditions. For UPSC, understanding these specific trade policy tools is vital for analyzing international trade dynamics, potential trade wars, and their impact on global supply chains and economies, including India. Key terms include protectionism, trade barriers, multilateral trading system, and WTO rules. This has significant implications for global economic stability.",
      "category": "economy",
      "date": "2026-02-21",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/explained/explained-economics/section-122-trump-tariffs-10543984/",
      "importance": "high",
      "tags": [
        "Trade Tariffs",
        "International Trade",
        "US Trade Policy",
        "Global Economy",
        "Protectionism"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-III: Economy",
        "GS-II: International Relations"
      ],
      "section": "Explained",
      "processedAt": "2026-02-21T10:17:21.454Z"
    },
    {
      "id": "2026-02-21-trump-s-proposed-10-tariffs-mechanism-global-economic-impact",
      "title": "Trump's Proposed 10% Tariffs: Mechanism & Global Economic Impact",
      "summary": "The article details how former President Trump's proposed 10% tariffs would work and their potential global ramifications. These tariffs, if implemented, could target a wide range of imported goods, aiming to protect domestic industries and reduce trade deficits. For UPSC, this is crucial for understanding the potential shift in global trade policies, the rise of protectionism, and its impact on international economic relations. Aspirants should analyze the implications for global supply chains, inflation, retaliatory measures by other countries, and how such policies could affect India's exports, trade balance, and economic growth. Key terms include trade wars and economic nationalism.",
      "category": "economy",
      "date": "2026-02-21",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/explained/explained-economics/new-trump-tariffs-meaning-10543882/",
      "importance": "high",
      "tags": [
        "Trade Tariffs",
        "US Trade Policy",
        "Global Trade",
        "Economic Protectionism",
        "International Relations"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-III: Economy",
        "GS-II: International Relations"
      ],
      "section": "Explained",
      "processedAt": "2026-02-21T10:17:21.454Z"
    },
    {
      "id": "2026-02-21-india-france-strategic-partnership-resilience-amidst-global",
      "title": "India-France Strategic Partnership: Resilience Amidst Global Shifts",
      "summary": "The article explores the enduring nature of India's decades-old friendship with France, particularly its resilience against potential pressures from a 'Trump 2.0' administration. The India-France strategic partnership is characterized by deep cooperation in defense, nuclear energy, space technology, and multilateral forums. For UPSC, this highlights the importance of strategic autonomy in India's foreign policy and its ability to maintain strong bilateral ties with key partners irrespective of shifts in global power dynamics. Aspirants should understand the pillars of this relationship, its significance for India's security and technological advancement, and its role in fostering a multipolar world order.",
      "category": "ir",
      "date": "2026-02-21",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/explained/explained-global/india-france-friendship-trump-us-10543237/",
      "importance": "high",
      "tags": [
        "India-France Relations",
        "Strategic Partnership",
        "Foreign Policy",
        "Geopolitics",
        "Multipolar World"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-II: International Relations"
      ],
      "section": "Explained",
      "processedAt": "2026-02-21T10:17:21.454Z"
    },
    {
      "id": "2026-02-21-us-iran-tensions-prospects-of-conflict-regional-implications",
      "title": "US-Iran Tensions: Prospects of Conflict & Regional Implications",
      "summary": "The article discusses the escalating tensions between the US and Iran, with US forces reportedly nearing Iran, and analyzes the prospects of an attack. This situation in the Middle East is critical due to its potential impact on global oil markets, regional stability, and international security. For UPSC, understanding the geopolitical dynamics of the Middle East, the roles of major global powers, and the implications for India's energy security and diaspora is crucial. Key terms include Strait of Hormuz, regional proxies, nuclear deal (JCPOA), and international sanctions. Aspirants should analyze the potential for conflict escalation and its broader consequences.",
      "category": "security",
      "date": "2026-02-21",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/explained/explained-global/as-us-forces-near-iran-what-we-know-so-far-about-the-prospects-of-an-attack-10543351/",
      "importance": "high",
      "tags": [
        "US-Iran Relations",
        "Middle East Conflict",
        "Geopolitics",
        "Energy Security",
        "International Security"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-II: International Relations",
        "GS-III: Security"
      ],
      "section": "Explained",
      "processedAt": "2026-02-21T10:17:21.454Z"
    },
    {
      "id": "2026-02-20-india-s-response-to-us-supreme-court-ruling-on-trump-tariffs",
      "title": "India's Response to US Supreme Court Ruling on Trump Tariffs",
      "summary": "The US Supreme Court's decision to strike down tariffs imposed by the Trump administration under Section 232 of the Trade Expansion Act of 1962 has significant implications. India, a country affected by these tariffs, may see a shift in trade dynamics and potential for resolution of ongoing trade disputes. The ruling could prompt the US President to explore alternative trade measures or legislative routes, impacting global trade policy and India-US economic relations. Aspirants should understand concepts like tariffs, trade remedies, WTO dispute settlement, and their impact on India's foreign trade policy. This links to GS-II (International Relations) and GS-III (Indian Economy).",
      "category": "ir",
      "date": "2026-02-20",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/explained/explained-economics/how-india-may-respond-to-us-top-court-order-against-trumps-tariffs-and-the-alternatives-for-the-us-president-10543430/",
      "importance": "high",
      "tags": [
        "US Trade Policy",
        "Tariffs",
        "WTO",
        "India-US Relations",
        "International Trade Law"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-II: International Relations",
        "GS-III: Indian Economy"
      ],
      "section": "Explained",
      "processedAt": "2026-02-21T10:17:45.387Z"
    },
    {
      "id": "2026-02-20-us-supreme-court-strikes-down-trump-tariffs-refund-implicati",
      "title": "US Supreme Court Strikes Down Trump Tariffs: Refund Implications",
      "summary": "The US Supreme Court has struck down tariffs imposed by the Trump administration, potentially opening the door for refunds to countries and companies that paid them. This ruling, likely concerning Section 232 tariffs, signifies a major development in international trade law and US trade policy. The possibility of refunds could have financial implications for affected entities globally and influence future trade remedy actions by the US. For UPSC, understanding the legal basis of tariffs (e.g., Section 232), the role of the US Supreme Court in trade policy, and the economic impact of such decisions is crucial. This is relevant for GS-II (IR) and GS-III (Economy).",
      "category": "ir",
      "date": "2026-02-20",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/explained/explained-economics/us-supreme-court-trump-tariffs-illegal-india-trade-10543377/",
      "importance": "high",
      "tags": [
        "US Trade Policy",
        "Tariffs",
        "Trade Remedies",
        "International Trade Law",
        "US Supreme Court"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-II: International Relations",
        "GS-III: Indian Economy"
      ],
      "section": "Explained",
      "processedAt": "2026-02-21T10:17:45.387Z"
    },
    {
      "id": "2026-02-20-gujarat-marriage-registration-parental-consent-vs-fundamenta",
      "title": "Gujarat Marriage Registration: Parental Consent vs. Fundamental Rights",
      "summary": "Gujarat's provision mandating parental consent for marriage registration is facing scrutiny for potentially infringing upon fundamental rights. Critics argue that such a requirement undermines individual autonomy, the right to privacy, and the right to marry, which are enshrined under Article 21 of the Indian Constitution and affirmed by various Supreme Court judgments (e.g., Hadiya case, Puttaswamy judgment). This issue highlights the conflict between state legislation, societal norms, and constitutional liberties. Aspirants should understand fundamental rights, judicial precedents concerning personal liberty, and the scope of state intervention in personal matters. This is relevant for GS-II (Polity) and GS-I (Indian Society).",
      "category": "polity",
      "date": "2026-02-20",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/explained/explained-law/marriage-registration-in-gujarat-parental-consent-provision-flies-in-the-face-of-rights-court-rulings-10543378/",
      "importance": "high",
      "tags": [
        "Fundamental Rights",
        "Right to Marry",
        "Judicial Review",
        "Personal Liberty",
        "Social Legislation"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-II: Polity & Governance",
        "GS-I: Indian Society"
      ],
      "section": "Explained",
      "processedAt": "2026-02-21T10:17:45.387Z"
    },
    {
      "id": "2026-02-20-us-iran-tensions-global-oil-prices-implications-for-india",
      "title": "US-Iran Tensions & Global Oil Prices: Implications for India",
      "summary": "Global oil prices have surged to a 6-month high, primarily due to escalating US-Iran tensions. Potential disruptions in the Strait of Hormuz, a vital chokepoint for global oil shipments, or renewed sanctions against Iran, could severely impact crude oil supplies. For India, a major oil importer, this situation poses significant economic challenges, including increased import bills, inflationary pressures, and a widening current account deficit. Ensuring energy security through diversification of sources and strategic reserves becomes paramount for India in such volatile geopolitical scenarios. This is crucial for GS-III (Indian Economy) and GS-II (International Relations).",
      "category": "economy",
      "date": "2026-02-20",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/explained/explained-economics/oil-prices-high-us-iran-tensions-risk-india-impact-10542757/",
      "importance": "high",
      "tags": [
        "Energy Security",
        "Oil Prices",
        "US-Iran Relations",
        "Geopolitics",
        "Indian Economy",
        "Strait of Hormuz"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-III: Indian Economy",
        "GS-II: International Relations"
      ],
      "section": "Explained",
      "processedAt": "2026-02-21T10:17:45.387Z"
    },
    {
      "id": "2026-02-21-home-minister-vows-to-eliminate-maoism-by-march-31",
      "title": "Home Minister Vows to Eliminate Maoism by March 31",
      "summary": "Union Home Minister Amit Shah declared that Maoism (Left Wing Extremism - LWE) would be eradicated from India by March 31. He highlighted the significant role of the CRPF in achieving this, alongside their contributions in reducing stone-pelting incidents in Jammu and Kashmir and managing ethnic violence in Manipur. This statement underscores the government's firm stance on internal security, its strategy against LWE, and the crucial role of central armed police forces. Aspirants should understand LWE as an internal security threat, government counter-insurgency strategies, and the mandate of forces like CRPF.",
      "category": "security",
      "date": "2026-02-21",
      "source": "The Hindu",
      "sourceUrl": "https://www.thehindu.com/news/national/maoism-to-be-eliminated-from-india-by-march-31-home-minister-amit-shah/article70659465.ece",
      "importance": "high",
      "tags": [
        "Internal Security",
        "Left Wing Extremism",
        "Maoism",
        "CRPF",
        "Counter-Insurgency"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-III: Internal Security"
      ],
      "section": "National",
      "processedAt": "2026-02-21T10:18:10.621Z"
    },
    {
      "id": "2026-02-21-ai-in-education-beyond-gadgets-to-real-classroom-integration",
      "title": "AI in Education: Beyond Gadgets to Real Classroom Integration",
      "summary": "The article critiques the superficial adoption of Artificial Intelligence (AI) in education, exemplified by a 'robodog,' arguing that the real challenge lies in meaningful classroom integration. It emphasizes moving beyond mere technological displays to focus on pedagogical reforms, teacher training, curriculum development, and addressing ethical considerations of AI in learning. For UPSC, this is relevant for understanding the practical applications and challenges of emerging technologies like AI in social sectors. Key terms include digital literacy, educational technology, skill development, and equitable access to technology. It links to human resource development and future workforce preparedness.",
      "category": "science",
      "date": "2026-02-21",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/opinion/editorials/galgotias-robodog-is-for-the-memes-real-ai-challenge-lies-in-classrooms-10543345/",
      "importance": "medium",
      "tags": [
        "Artificial Intelligence",
        "Education Reform",
        "Digital Literacy",
        "Technology in Education",
        "Skill Development"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-II: Social Justice",
        "GS-III: Science & Technology"
      ],
      "section": "Editorial",
      "processedAt": "2026-02-21T10:17:21.454Z"
    },
    {
      "id": "2026-02-20-economic-impact-of-trump-s-tariffs-shifting-cost-burden",
      "title": "Economic Impact of Trump's Tariffs: Shifting Cost Burden",
      "summary": "The economic incidence of tariffs imposed by the Trump administration is a complex issue, with the burden slowly shifting. While tariffs are designed to protect domestic industries, studies indicate that their costs are often borne by domestic consumers through higher prices and by importing businesses, rather than solely by foreign exporters. This analysis underscores the intricate dynamics of international trade and the unintended consequences of protectionist policies on global supply chains and consumer welfare. Aspirants should grasp concepts like tariffs, trade wars, economic incidence, and their impact on inflation and consumer prices, linking to GS-III (Indian Economy) and GS-II (International Relations).",
      "category": "economy",
      "date": "2026-02-20",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/explained/explained-economics/donald-trump-tariffs-us-who-pays-10543096/",
      "importance": "medium",
      "tags": [
        "Tariffs",
        "Trade Policy",
        "Economic Impact",
        "International Trade",
        "Protectionism"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-III: Indian Economy",
        "GS-II: International Relations"
      ],
      "section": "Explained",
      "processedAt": "2026-02-21T10:17:45.387Z"
    },
    {
      "id": "2026-02-20-india-s-observer-role-in-trump-s-board-of-peace-initiative",
      "title": "India's Observer Role in Trump's 'Board of Peace' Initiative",
      "summary": "India participated as an 'observer' in a meeting related to former US President Trump's 'Board of Peace' initiative. This engagement reflects India's strategic foreign policy of multi-alignment, where it maintains diplomatic channels and monitors various global platforms without necessarily endorsing their full agenda. Observer status allows India to gather intelligence, understand evolving geopolitical narratives, and protect its interests in a complex international environment. This approach is crucial for India to navigate global power dynamics and ensure its voice is heard, even in nascent or unconventional diplomatic forums. This is relevant for GS-II (International Relations).",
      "category": "ir",
      "date": "2026-02-20",
      "source": "Indian Express",
      "sourceUrl": "https://indianexpress.com/article/explained/explained-global/why-india-joined-board-of-peace-meet-10543036/",
      "importance": "medium",
      "tags": [
        "India's Foreign Policy",
        "Geopolitics",
        "International Relations",
        "Diplomacy",
        "Multi-alignment"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-II: International Relations"
      ],
      "section": "Explained",
      "processedAt": "2026-02-21T10:17:45.387Z"
    },
    {
      "id": "2026-02-21-bangladesh-to-restore-visas-for-indian-nationals",
      "title": "Bangladesh to Restore Visas for Indian Nationals",
      "summary": "Diplomatic sources indicate that Bangladesh is moving towards restoring visa services for Indian nationals, which were halted in December 2025 following protests and incidents targeting Indian missions and visa centers. This development signifies an improvement in bilateral relations and a return to normalcy in diplomatic ties between India and Bangladesh. The restoration of visas is crucial for facilitating trade, tourism, and people-to-people contact, which are vital components of the strong historical and cultural bonds shared by the two nations. Aspirants should understand the dynamics of India's 'Neighbourhood First' policy and the importance of stable bilateral relations. This is relevant for GS-II (International Relations).",
      "category": "ir",
      "date": "2026-02-21",
      "source": "The Hindu",
      "sourceUrl": "https://www.thehindu.com/news/international/bangladesh-moving-towards-restoring-visa-for-indian-nationals-diplomatic-sources/article70659473.ece",
      "importance": "medium",
      "tags": [
        "India-Bangladesh Relations",
        "Diplomacy",
        "Bilateral Ties",
        "Visa Policy",
        "Neighbourhood First"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-II: International Relations"
      ],
      "section": "National",
      "processedAt": "2026-02-21T10:17:45.388Z"
    },
    {
      "id": "2026-02-21-protests-over-medical-negligence-public-health-accountabilit",
      "title": "Protests over Medical Negligence & Public Health Accountability",
      "summary": "Congress protests against Kerala's Health Minister over an artery forceps left in a patient post-surgery highlight critical issues of medical negligence and accountability in public health institutions. While the CPI(M) termed the protests unwarranted, the incident underscores the need for robust patient safety protocols, stringent oversight in government hospitals, and mechanisms for redressal. This case is crucial for understanding challenges in healthcare delivery, patient rights, and the role of political accountability in ensuring quality public services. Aspirants should know about patient safety, medical ethics, and public health governance.",
      "category": "social",
      "date": "2026-02-21",
      "source": "The Hindu",
      "sourceUrl": "https://www.thehindu.com/news/national/kerala/cpim-state-secretariat-terms-congress-protests-against-health-minister-veena-george-unwarranted-accuses-opposition-of-attempting-to-instigate-riots/article70659349.ece",
      "importance": "medium",
      "tags": [
        "Public Health",
        "Medical Negligence",
        "Patient Safety",
        "Healthcare Governance",
        "Accountability"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-II: Social Justice",
        "GS-II: Governance"
      ],
      "section": "National",
      "processedAt": "2026-02-21T10:18:10.621Z"
    },
    {
      "id": "2026-02-21-tn-cm-inaugurates-global-engineering-hub-boosts-state-econom",
      "title": "TN CM Inaugurates Global Engineering Hub, Boosts State Economy",
      "summary": "Tamil Nadu Chief Minister M.K. Stalin inaugurated Pinnacle Infotech's global engineering hub in Madurai and laid the foundation for a housing project for 1,200 employees. This initiative signifies the state's focus on attracting investments, fostering industrial growth, and creating employment opportunities, particularly in tier-2 cities. Such developments are crucial for balanced regional growth, skill development, and enhancing the state's economic competitiveness. Aspirants should understand the role of state governments in industrial policy, infrastructure development, and employment generation.",
      "category": "economy",
      "date": "2026-02-21",
      "source": "The Hindu",
      "sourceUrl": "https://www.thehindu.com/news/national/tamil-nadu/tn-cm-stalin-inaugurates-pinnacle-infotechs-global-engineering-hub-in-madurai/article70659182.ece",
      "importance": "medium",
      "tags": [
        "Industrial Development",
        "Investment",
        "Employment Generation",
        "Regional Development",
        "State Economy"
      ],
      "prelims": false,
      "mains": true,
      "gsRelevance": [
        "GS-III: Indian Economy",
        "GS-II: Governance"
      ],
      "section": "National",
      "processedAt": "2026-02-21T10:18:10.621Z"
    },
    {
      "id": "2026-02-21-telangana-prisons-dept-denies-terror-linked-mulaqat-reports",
      "title": "Telangana Prisons Dept. Denies Terror-Linked Mulaqat Reports",
      "summary": "The Telangana Prisons Department denied reports alleging terror-linked 'mulaqats' (meetings) at Hyderabad's Central Jail, stating the news was unverified. This incident highlights the critical importance of robust prison administration, security protocols, and intelligence gathering to prevent radicalization and maintain internal security within correctional facilities. It also underscores the need for verified information in sensitive matters. Aspirants should be aware of challenges in prison management, the issue of radicalization in jails, and the role of prison reforms in internal security.",
      "category": "security",
      "date": "2026-02-21",
      "source": "The Hindu",
      "sourceUrl": "https://www.thehindu.com/news/national/telangana/telangana-prisons-department-denies-reports-of-terror-linked-mulaqats-at-central-jail-in-hyderabad/article70659418.ece",
      "importance": "medium",
      "tags": [
        "Prison Reforms",
        "Internal Security",
        "Prison Administration",
        "Radicalization",
        "Intelligence"
      ],
      "prelims": false,
      "mains": true,
      "gsRelevance": [
        "GS-II: Governance",
        "GS-III: Internal Security"
      ],
      "section": "National",
      "processedAt": "2026-02-21T10:18:10.621Z"
    },
    {
      "id": "2026-02-21-mamata-emphasizes-respect-for-all-languages-on-mother-langua",
      "title": "Mamata Emphasizes Respect for All Languages on Mother Language Day",
      "summary": "West Bengal Chief Minister Mamata Banerjee, on International Mother Language Day, reiterated the importance of respecting all languages equally and pledged unity against any attack on linguistic diversity. This statement underscores India's rich linguistic heritage, the constitutional provisions safeguarding linguistic rights, and the significance of promoting multilingualism for national integration and cultural preservation. Aspirants should be aware of International Mother Language Day, constitutional provisions related to languages (e.g., Eighth Schedule), and the cultural significance of linguistic diversity.",
      "category": "social",
      "date": "2026-02-21",
      "source": "The Hindu",
      "sourceUrl": "https://www.thehindu.com/news/national/all-languages-equally-worthy-of-respect-mamata-on-international-mother-language-day/article70659422.ece",
      "importance": "medium",
      "tags": [
        "Linguistic Diversity",
        "Cultural Heritage",
        "National Integration",
        "International Mother Language Day",
        "Constitutional Values"
      ],
      "prelims": true,
      "mains": true,
      "gsRelevance": [
        "GS-I: Indian Heritage and Culture",
        "GS-II: Social Justice"
      ],
      "section": "National",
      "processedAt": "2026-02-21T10:18:10.621Z"
    },
    {
      "id": "2026-02-21-demand-for-new-ksrp-battalion-in-raichur-for-law-order",
      "title": "Demand for New KSRP Battalion in Raichur for Law & Order",
      "summary": "A KSPCA member urged the Karnataka Chief Minister to allocate funds for a 13th Karnataka State Reserve Police (KSRP) battalion in Raichur in the upcoming 2026-27 budget. The demand highlights the existing logistical challenges, with current battalions being far from Raichur, impacting emergency response times. This issue underscores the importance of adequate police force deployment, resource allocation in state budgets for law and order, and police reforms to ensure effective governance and internal security at the local level.",
      "category": "security",
      "date": "2026-02-21",
      "source": "The Hindu",
      "sourceUrl": "https://www.thehindu.com/news/national/karnataka/kspca-member-urges-karnataka-cm-to-announce-13th-ksrp-battalion-for-raichur-in-202627-budget/article70659283.ece",
      "importance": "medium",
      "tags": [
        "Police Reforms",
        "Law and Order",
        "State Budget",
        "Internal Security",
        "Resource Allocation"
      ],
      "prelims": false,
      "mains": true,
      "gsRelevance": [
        "GS-II: Governance",
        "GS-III: Internal Security"
      ],
      "section": "National",
      "processedAt": "2026-02-21T10:18:10.621Z"
    }
  ],
  "sources": [
    "The Hindu",
    "Indian Express",
    "News on AIR"
  ],
  "totalScraped": 30,
  "totalProcessed": 20
}